app/views/projects/index.html.erb

<h1><%= pluralize(@projects.size, 'Project') %></h1>
---
SELECT "projects".* FROM "projects"  WHERE (pledging_ends_on >= '2015-09-21 15:16:04.496469')  ORDER BY pledging_ends_on
SELECT COUNT(*) FROM "projects"  WHERE (pledging_ends_on >= '2015-09-21 15:16:04.496469')