app/controllers/projects_controller.rb

SELECT  "projects".* FROM "projects"  WHERE "projects"."id" = ? LIMIT 1  [["id", 6]]
UPDATE "projects" SET "image_file_name" = ?, "name" = ?, "team_members" = ?, "updated_at" = ?, "website" = ? WHERE "projects"."id" = 6  [["image_file_name", "cookie_wookie.jpg"], ["name", "Going Solo Cookie Wookies"], ["team_members", "1"], ["updated_at", "2015-09-21 22:06:09.352951"], ["website", "www.giveupthecookiewookie.com"]]
---
  def update
    @project = Project.find(params[:id])
    @project.update(project_params)

INSERT INTO "projects" ("created_at", "description", "image_file_name", "name", "pledging_ends_on", "target_pledge_amount", "team_members", "updated_at", "website") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @project = Project.new(project_params)
    @project.save